app/controllers/red_days_controller.rb

SELECT "red_days".* FROM "red_days"
---
  def index
    @red_days = RedDay.all

INSERT INTO "red_days" ("good_day", "created_at", "updated_at") VALUES (?, ?, ?)  [["good_day", "2018-04-21"], ["created_at", "2018-04-21 12:18:22.152342"], ["updated_at", "2018-04-21 12:18:22.152342"]]
---
  def create
    @red_day = RedDay.new(red_day_params)

    respond_to do |format|
      if @red_day.save

SELECT  "red_days".* FROM "red_days" WHERE "red_days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_red_day
      @red_day = RedDay.find(params[:id])